const cardsData = [
    {
        image: "1.jpg",
        title: "不一样的开始",
        text: "这个开始很不一样～我不知道你的名字，你的性别，你的样貌…而你也只知道我的性别。神秘似乎是一开始的主调。"
    },
    {
        image: "2.jpg",
        title: "推理和猜测",
        text: "后来啊～猜起了很多东西，性别、姓名、住址…然后我推测出了你的住址—— 9 栋 1 单元。猜测似乎是这时的主调。"
    },
    {
        image: "3.jpg",
        title: "互相分享",
        text: "再后来啊～分享的东西也越来越多了，生活、感想、饮食、还有一起听歌···分享似乎是那时的主调。"
    },
    {
        image: "4.jpg",
        title: "你的名字",
        text: "慢慢地，我知道了你的名字：何姨（bushi)，HYL。你也知道了我的名字…我胆子也慢慢大了起来，开启了一个“新纪元”。"
    },
    {
        image: "5.jpg",
        title: "新的开始",
        text: "你的第一条语音让我觉得：哇！声音好好听！你的第一张露眼照片让我觉得：哇！很好看！你的第一张露脸照片让我觉得：哇！原来是酱紫漂亮！你的第一个视频让我觉得：哇！比照片更好看啊！后来每一次的语音，照片和视频都让我感受很深。"
    },
    {
        image: "6.jpg",
        title: "你的影响",
        text: "你讲的故事我很爱听，我也开始试着用语音讲故事；你发的照片我很喜欢看，我也试着第一次给女生发自己的照片；你发的视频我依旧很爱看，我……我不敢（诶嘿）。"
    },
    {
        image: "7.jpg",
        title: "难忘的记忆",
        text: "2026.3.22 这一天最最令我难忘！人生中第一次有人送我奶茶！想哭…因为感动，因为开心，因为驱散了黑点！我知道，还有很多很多值得难忘的点，但太多了，这里写不下了～"
    },
    {
        image: "8.jpg",
        title: "100天！",
        text: "终于！100 天了！2026.5.17！好快啊…似乎有点单调，再加一个字呢？好快乐啊！期待下一个 100 天！"
    },
         {
        image: "9.jpg",
        title: "值得我铭记的日子！",
        text: "2026.2.27······\n2026.3.22这是你第一次送我奶茶的日子！\n2026.3.30这是你发过来的第一张不是闪照的照片的日子！\n2026.4.04这是你第一次发关于你的视频的日子！\n2026.4.19这是你再次送我奶茶的日子！\n2026.4.27······\n2026.4.30这是你送我果切的日子！\n2026.5.18···美梦！！\n2026.5.23这是你送我甜点的日子！"
    }
];

// 你的心情预设（可选：yuyue / youxian / qidai / ziyou / beishang / gudu / fennu / yihan / wuliao / kongxu / fadian /）
const myMood = "kongxu";
